```module.s3.module.isbabymaciocehereyet.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:153542816638:certificate/74685574-5ab8-4b78-af76-9b9e1e2b5444]
module.s3.aws_route53_zone.nickmacioce: Refreshing state... [id=Z0408742MN1DB2L1IVKL]
module.s3.module.isbabymaciocehereyet.aws_s3_bucket.website_root: Refreshing state... [id=isbabymaciocehereyet.com-root]
module.s3.module.nickmacioce.aws_s3_bucket.website_root: Refreshing state... [id=nickmacioce.com-root]
module.s3.aws_s3_bucket.b: Refreshing state... [id=macioce-tf-test-bucket]
module.s3.aws_route53_zone.baby-macioce: Refreshing state... [id=Z04297862RMBF7HTXKRLG]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0b89592ea7423cf94]
module.s3.module.links-nickmacioce.aws_s3_bucket.website_root: Refreshing state... [id=links.nickmacioce.com-root]
module.s3.module.nickmacioce.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:153542816638:certificate/4e70f32a-ff67-4d20-a20a-d9acf9c6e1da]
module.s3.module.links-nickmacioce.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:153542816638:certificate/32e2ff15-f95f-4a15-91f4-4ab8cca0c89d]
module.s3.module.nickmacioce.aws_s3_bucket_policy.update_website_root_bucket_policy: Refreshing state... [id=nickmacioce.com-root]
module.s3.module.isbabymaciocehereyet.aws_s3_bucket_policy.update_website_root_bucket_policy: Refreshing state... [id=isbabymaciocehereyet.com-root]
module.s3.module.isbabymaciocehereyet.aws_route53_record.wildcard_validation["isbabymaciocehereyet.com"]: Refreshing state... [id=Z04297862RMBF7HTXKRLG__3a5e9f534e0cc1514e2261d4e69fa372.isbabymaciocehereyet.com._CNAME]
module.s3.module.isbabymaciocehereyet.aws_route53_record.wildcard_validation["*.isbabymaciocehereyet.com"]: Refreshing state... [id=Z04297862RMBF7HTXKRLG__3a5e9f534e0cc1514e2261d4e69fa372.isbabymaciocehereyet.com._CNAME]
module.s3.module.nickmacioce.aws_route53_record.wildcard_validation["nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__16b994c0d16039e5552bba8bdc404476.nickmacioce.com._CNAME]
module.s3.module.nickmacioce.aws_route53_record.wildcard_validation["*.nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__16b994c0d16039e5552bba8bdc404476.nickmacioce.com._CNAME]
module.s3.module.links-nickmacioce.aws_route53_record.wildcard_validation["links.nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__d501e5c61d85996ce4395a16dfc2859e.links.nickmacioce.com._CNAME]
module.s3.module.links-nickmacioce.aws_route53_record.wildcard_validation["*.links.nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__d501e5c61d85996ce4395a16dfc2859e.links.nickmacioce.com._CNAME]
module.s3.module.isbabymaciocehereyet.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-08-15 04:44:12 +0000 UTC]
module.s3.module.nickmacioce.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-08-15 04:44:14 +0000 UTC]
module.networking.aws_subnet.private_subnet_1: Refreshing state... [id=subnet-01b751997de387cd5]
module.networking.aws_subnet.public_subnet_1: Refreshing state... [id=subnet-097774274a64c6abd]
module.s3.module.links-nickmacioce.aws_s3_bucket_policy.update_website_root_bucket_policy: Refreshing state... [id=links.nickmacioce.com-root]
module.s3.module.links-nickmacioce.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-08-15 04:44:20 +0000 UTC]
module.s3.module.isbabymaciocehereyet.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=EKU74NXRQDNYF]
module.s3.module.links-nickmacioce.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=E1XIU9LHYXL6GI]
module.s3.module.nickmacioce.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=EWL5EBD36576X]
module.s3.module.isbabymaciocehereyet.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z04297862RMBF7HTXKRLG_isbabymaciocehereyet.com_A]
module.s3.module.links-nickmacioce.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z0408742MN1DB2L1IVKL_links.nickmacioce.com_A]
module.s3.module.nickmacioce.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z0408742MN1DB2L1IVKL_nickmacioce.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.s3.module.stage-nickmacioce.data.aws_acm_certificate.wildcard_website will be read during apply
  # (config refers to values not yet known)
 <= data "aws_acm_certificate" "wildcard_website"  {
      + arn         = (known after apply)
      + domain      = "stage.nickmacioce.com"
      + id          = (known after apply)
      + most_recent = true
      + status      = (known after apply)
      + statuses    = [
          + "ISSUED",
        ]
      + tags        = (known after apply)
    }

  # module.s3.module.stage-nickmacioce.aws_acm_certificate.wildcard_website will be created
  + resource "aws_acm_certificate" "wildcard_website" {
      + arn                       = (known after apply)
      + domain_name               = "stage.nickmacioce.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.stage.nickmacioce.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "stage.nickmacioce.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.stage.nickmacioce.com",
        ]
      + tags                      = (known after apply)
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.s3.module.stage-nickmacioce.aws_acm_certificate_validation.wildcard_cert will be created
  + resource "aws_acm_certificate_validation" "wildcard_cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.s3.module.stage-nickmacioce.aws_cloudfront_distribution.website_cdn_root will be created
  + resource "aws_cloudfront_distribution" "website_cdn_root" {
      + aliases                        = [
          + "stage.nickmacioce.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + custom_error_response {
          + error_caching_min_ttl = 300
          + error_code            = 404
          + response_code         = 404
          + response_page_path    = "/404.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = true
          + default_ttl            = 300
          + max_ttl                = 1200
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = (known after apply)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.s3.module.stage-nickmacioce.aws_route53_record.website_cdn_root_record will be created
  + resource "aws_route53_record" "website_cdn_root_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "stage.nickmacioce.com"
      + type            = "A"
      + zone_id         = "Z0408742MN1DB2L1IVKL"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.s3.module.stage-nickmacioce.aws_route53_record.wildcard_validation["*.stage.nickmacioce.com"] will be created
  + resource "aws_route53_record" "wildcard_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0408742MN1DB2L1IVKL"
    }

  # module.s3.module.stage-nickmacioce.aws_route53_record.wildcard_validation["stage.nickmacioce.com"] will be created
  + resource "aws_route53_record" "wildcard_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0408742MN1DB2L1IVKL"
    }

  # module.s3.module.stage-nickmacioce.aws_s3_bucket.website_root will be created
  + resource "aws_s3_bucket" "website_root" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "stage.nickmacioce.com-root"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "404.html"
          + index_document = "index.html"
        }
    }

  # module.s3.module.stage-nickmacioce.aws_s3_bucket_policy.update_website_root_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "update_website_root_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```